---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.NumberOfSlots
source: html/ad720121-48c1-c2a4-57a7-fec1543fa865.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.NumberOfSlots Property

The number of slots in the panel schedule; setting this value must go through the appropriate update function

## Syntax (C#)
```csharp
public int NumberOfSlots { get; }
```